erp3l/src/Enums/РежимыФормированияРасходныхОрдеров/РежимыФормированияРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыФормированияРасходныхОрдеров</name>
  <enumValues>
    <name>Менеджером</name>
  </enumValues>
  <enumValues>
    <name>Кладовщиком</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/РежимыФормированияРасходныхОрдеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по режиму формирования расходных ордеров.
//
// Параметры:
//  РежимФормированияРасходныхОрдеров	 - ПеречислениеСсылка.РежимыФормированияРасходныхОрдеров - режим формирования
//  расходных ордеров.
// 
// Возвращаемое значение:
//  Строка - подсказка по режиму формирования расходных ордеров.
//
Функция ПодсказкаПоРежимуФормирования(РежимФормированияРасходныхОрдеров) Экспорт
	
	Если РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически Тогда
		Возврат НСтр("ru = 'Ордера формируются и переформировываются автоматически после записи документов, влияющих на их формирование: заказов, накладных, заданий на перевозку.';
					|en = 'Notes are created and recreated automatically after the documents that influence their creation are saved, such as: orders, invoices, delivery orders.'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Кладовщиком Тогда
		Возврат НСтр("ru = 'Кладовщик вручную инициирует формирование и переформирование расходных ордеров по распоряжениям на отгрузку в рабочем месте ""Отгрузка"".';
					|en = 'The warehouse keeper manually starts creating and recreating goods issue notes under shipment references in the ""Shipment"" workplace.'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Менеджером Тогда
		Возврат НСтр("ru = 'Менеджер инициирует формирование и переформирование расходных ордеров из списков распоряжений на отгрузку (т.е. из списков заказов и накладных). При использовании доставки ордера формирует менеджер по доставке в целом по заданию на перевозку.';
					|en = 'The officer initiates generation and regeneration of goods issue notes from shipment reference lists (i.e. from the lists of orders and sales invoices). If delivery is used, the delivery officer generates notes for the whole delivery order.'");
	Иначе
		Возврат НСтр("ru = 'Определяет инициатора формирования расходных ордеров.';
					|en = 'Determines an initiator of goods issue note generation.'");
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
